app/controllers/constraint_week_templates_controller.rb

	def new
		@cds = ConstraintDay.all
---
SELECT "constraint_days".* FROM "constraint_days"

	def index
		@cds = ConstraintDay.all
		@cwts = ConstraintWeekTemplate.all
---
SELECT "constraint_days".* FROM "constraint_days"
SELECT "constraint_week_templates".* FROM "constraint_week_templates"

	def create
		@cwt = ConstraintWeekTemplate.new(cwt_params)
		if @cwt.save
			redirect_to constraint_week_templates_path
		else
			@cds = ConstraintDay.all
---
INSERT INTO "constraint_week_templates" ("name", "max_lookahead_for_reh", "max_lookahead_for_perf", "monday_id", "tuesday_id", "wednesday_id", "thursday_id", "friday_id", "saturday_id", "sunday_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "constraint_days".* FROM "constraint_days"