app/controllers/reservations_controller.rb

SELECT "reservations".* FROM "reservations"
---
	def new
		@reservations = Reservation.all

INSERT INTO "reservations" ("is_performance", "start_time", "end_time", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
SELECT "reservations".* FROM "reservations"
---
	def create
		# p '$'*80
		# p 'mergey pergey'
		# p "#{full_params.except(:block).merge(block_to_start_end)}"

		@res = Reservation.new(res_params)
		cwt = ConstraintWeekTemplate.current


		# p 'block_to_start_end'
		# p "#{block_to_start_end.inspect}"

		if cwt.validate(@res)
			@res.save
			flash[:notice] = "Reservation added!"
			redirect_to new_reservation_path
		else
			@reservations = Reservation.all